---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DecalAttributes
source: html/cd5251e7-070c-437c-0335-997e337df2d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DecalAttributes Property

"Decal Attributes"

## Syntax (C#)
```csharp
public static ForgeTypeId DecalAttributes { get; }
```